# 1
City = input("Укажите город, где Вы находитесь:")
Age = int(input("Укажите количество полных лет:"))
Temperature = float(input("Укажите Вашу температуру тела:"))
print(
    f"Внимание! В городе {City} обнаружен {Age}-летний гражданин с температурой тела 39.2 градуса, "
    f"хотя он и пытался ложно заявить, что его температура {Temperature} градусов! ")
